***** Factory
#+BEGIN_SRC python :results output

  class A:
      def __init__(sellf):
          print('class A created')

  class B:
      def __init__(sellf):
          print('class B created')

  my_classes = [A, B]
  for cls in my_classes:
      cls()

  my_class_dict = { "A" : A,
                    "B": B
      }

  for class_name_key in my_class_dict.keys():
      my_class_dict[class_name_key]()
#+END_SRC

#+RESULTS:
: class A created
: class B created
: class A created
: class B created

***** Singleton

The Singleton pattern is used when we want to guarantee that only one instance of a given class exists during runtime.
Do we really need this pattern in Python? Based on my experience, it’s easier to simply create one instance intentionally
and then use it instead of implementing the Singleton pattern.

But should you want to implement it, here is some good news: In Python, we can alter the instantiation process (along
with virtually anything else). Remember the __new__() method I mentioned earlier? Here we go:

class Logger(object):
    def __new__(cls, *args, **kwargs):
        if not hasattr(cls, '_logger'):
            cls._logger = super(Logger, cls
                    ).__new__(cls, *args, **kwargs)
        return cls._logger

In this example, Logger is a Singleton.

These are the alternatives to using a Singleton in Python:

1. Use a module. 
2. Create one instance somewhere at the top-level of your application, perhaps in the config file. 
P3. ass the instance to every object that needs it. That’s a dependency injection and it’s a powerful and easily mastered
 mechanism. 

Singleton is a special case if we consider a class which restricts
the production of just n instances

#+BEGIN_SRC python :results output
  class Singleton:
      __instance = None
      @staticmethod
      def getinstance():
          if Singleton.__instance:
              return Singleton.__instance

      def __init__(self):
          if Singleton.__instance == None:
              Singleton.__instance = self
          else:
              raise Exception('This class is a Singleton, Use Singleton.getinstance()')
          

  s = Singleton()
  try:
      Singleton()
  except Exception as e:
      print(e)

  s1 = Singleton.getinstance()

  assert s == s1
  print(s)
  print(s1)
#+END_SRC

#+RESULTS:
: This class is a Singleton, Use Singleton.getinstance()
: <__main__.Singleton instance at 0x7f7726c5fe18>
: <__main__.Singleton instance at 0x7f7726c5fe18>

***** Chain of resposibility

This pattern gives us a way to treat a request using different methods, each one addressing a specific part of the request. You know, one of the best principles for good code is the Single Responsibility principle.

Every piece of code must do one, and only one, thing.

This principle is deeply integrated in this design pattern.

For example, if we want to filter some content we can implement different filters, each one doing one precise and clearly defined type of filtering. These filters could be used to filter offensive words, ads, unsuitable video content, and so on.


It is a chain of responsibility.
Each filters are chained together.

Or is this a good example?
Is this actually a command pattern
Check once more.

#+BEGIN_SRC python :results output

  # simulating with simple text search

  example_content = """I am a good content 1
  I am an offensive content
  I am a good content 2
  I am a good content 3
  I am an ad
  I am a good content 4
  I am an unsuitable video
  I am a good content 5"""


  def word_filter(content, word_to_remove):
      lines = []
      for line in content.split('\n'):
          if word_to_remove not in line:
              lines.append(line)
      return '\n'.join(lines)

  def offensive_filter(content):
      return word_filter(content, 'offensive')

  def ads_filter(content):
      return word_filter(content, 'ad')

  def unsuitable_video_filter(content):
      return word_filter(content, 'unsuitable video')


  class ContentFilter(object):
      def __init__(self, filters=None):
          self._filters = list()
          if filters is not None:
              self._filters = filters

      def filter(self, content):
          for filter in self._filters:
              content = filter(content)
          return content


  filter = ContentFilter([
                  offensive_filter,
                  ads_filter,
                  unsuitable_video_filter])

  filtered_content = filter.filter(example_content)

  print('original data was:')
  print(example_content)
  print()
  print('filtered data is:')
  print(filtered_content)

#+END_SRC

#+RESULTS:
#+begin_example
original data was:
I am a good content 1
I am an offensive content
I am a good content 2
I am a good content 3
I am an ad
I am a good content 4
I am an unsuitable video
I am a good content 5
()
filtered data is:
I am a good content 1
I am a good content 2
I am a good content 3
I am a good content 4
I am a good content 5
#+end_example

***** Command


The command pattern is handy in situations when, for some reason, we need to start by preparing what will be executed and then to execute it when needed. The advantage is that encapsulating actions in such a way enables
Python developers to add additional functionalities related to the executed actions, such as undo/redo, or keeping a
history of actions and the like.

Let’s see what a simple and frequently used example looks like:

#+BEGIN_SRC python :results output

    import os
    import tempfile

    class RenameFileCommand(object):
        def __init__(self, from_name, to_name):
            self._from = from_name
            self._to = to_name

        def execute(self):
            os.rename(self._from, self._to)

        def undo(self):
            os.rename(self._to, self._from)

    class History(object):
        def __init__(self):
            self._commands = list()

        def add(self, command):
            self._commands.append(command)
            
        def execute():
            for command in self._commands:
                command.execute()

        def undo(self):
            self._commands.pop().undo()

    tempdir = tempfile.gettempdir()
    docs_dir = 'docs'
    docs_dir_full_path = os.path.join(tempdir, docs_dir)
    if os.path.exists(docs_dir_full_path):
        os.rmdir(docs_dir_full_path)
    os.mkdir(docs_dir_full_path)
    old_file_1 = os.path.join(docs_dir_full_path, 'old_file_1.txt')
    new_file_1 = os.path.join(docs_dir_full_path, 'new_file_1.txt')
    old_file_2 = os.path.join(docs_dir_full_path, 'old_file_2.txt')
    new_file_2 = os.path.join(docs_dir_full_path, 'new_file_2.txt')

    def create_file(filename):
        with open(filename, 'w') as f:
            f.write(filename)  # add some dummy data into it

    # prepare the data for testing

    create_file(old_file_1)
    create_file(old_file_2)

    history = History()
    print(os.listdir(docs_dir_full_path))
    history.add(RenameFileCommand(old_file_1, new_file_1))
    history.add(RenameFileCommand(old_file_2, new_file_2))
    history.execute()
    print(os.listdir(docs_dir_full_path))
    history.undo()
    history.undo()
    print(os.listdir(docs_dir_full_path))
    
#+END_SRC

#+RESULTS:
: ['old_file_2.txt', 'old_file_1.txt']
: ['new_file_2.txt', 'new_file_1.txt']
: ['old_file_2.txt', 'old_file_1.txt']


***** Iterator
Built into python
Can use iterator and generator.

#+BEGIN_SRC python :results output
for i in range(3):
    print(i)

#+END_SRC

#+RESULTS:
: 0
: 1
: 2

**** DONE [#C] Install Detox cleansup filenames in linux
     SCHEDULED: <2016-10-22 Sat>
     Another option is to find another way and do it in python or in elisp
Example of bad filename
'Exploring Wikipedia With Apache Spark' - Advanced Training by Sameer Farooqui (Databricks)-vlVnSpJ6TDE.mp4
#+BEGIN_SRC python :results output
bad_filename = "'Exploring Wikipedia With Apache Spark' - Advanced Training by Sameer Farooqui (Databricks)-vlVnSpJ6TDE.mp4"
bad_characters = {"'":"",
                  " ": "_",
                  "(": "",
                  ")": ""
                 }
new_chars = []
for c in bad_filename:
    #print c, ord(c)
    
    if c in bad_characters:
        c = bad_characters[c]
    if c != "":
        new_chars.append(c)

print "".join(new_chars)


#+END_SRC

#+RESULTS:
: Exploring_Wikipedia_With_Apache_Spark_-_Advanced_Training_by_Sameer_Farooqui_Databricks-vlVnSpJ6TDE.mp4

http://detox.sourceforge.net/
#+BEGIN_SRC sh :results output
tempdir=$(mktemp -d /tmp/detox.XXXXX)
cd $tempdir
ls $tempdir
firefox https://sourceforge.net/projects/detox/files/latest/download?source=files
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh :results output
dir_1=$(ls -lrth /tmp|grep detox|tail -1|awk '{print $NF}')
directory=/tmp/$dir_1
echo $dir_1
echo $directory
mv ~/Downloads/detox*tar.bz2 $directory
cd $directory
ls -lrth
tar -jxvf detox*
ls -lrth
cd detox-1.2.0
cat README
2>&1 ./configure && make
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh :dir /sudo:: :results output
apt install detox

#+END_SRC

#+RESULTS:
: Reading package lists... 0%Reading package lists... 100%Reading package lists... Done
: Building dependency tree... 0%Building dependency tree... 0%Building dependency tree... 50%Building dependency tree... 50%Building dependency tree       
: Reading state information... 0%Reading state information... 0%Reading state information... Done
: detox is already the newest version (1.2.0-6).
: 0 upgraded, 0 newly installed, 0 to remove and 13 not upgraded.

